In [25]:
import pandas as pd
import numpy as np
import random
import string
np.random.seed(56)

In [6]:
pd.DataFrame({"a":[1,2], "b":[3,4],"c":[5,6]}, index=[1,2])

   a  b  c
1  1  3  5
2  2  4  6

In [11]:
pd.DataFrame([[1,2,3],[4,5,6],[7,8,9],[10,11,12]], index=range(1,5), columns=["A","B","C"])

    A   B   C
1   1   2   3
2   4   5   6
3   7   8   9
4  10  11  12

In [14]:
pd.Series({"한국":"서울","일본":"도쿄","중국":"베이징"})

한국     서울
일본     도쿄
중국    베이징
dtype: object

In [18]:
pd.DataFrame(np.random.randint(0, 100, size=(2, 3)))

    0   1   2
0  85  15  64
1  34  14  87

In [36]:
def id():
    return ''.join(random.choice(string.ascii_letters) for i in range(5))

In [37]:
id()

'hsFqb'

In [32]:
def score():
    return np.random.randint(0, 100)

In [33]:
score()

64

In [58]:
pd.DataFrame([[score() for i in range(1,5) ] for i in range(1,11)], index=[id() for i in range(1, 11)], columns=['국어','영어','수학','사회'])

       국어  영어  수학  사회
XcZmH  57  94  15   3
WJNvx  35  14  88  24
ZdkUB  56  41  94  77
cWlIz  62  85   1   5
AprVx  74  18  48  40
nVSjH  55  31  33  71
INrHr   6  95  38  73
LsGSL  45  19  92  82
ndNal  69  21  15  36
envoG  35  34  66  74

In [59]:
pd.DataFrame(np.random.randint(0, 100, size=(10, 4)),
             index=list((''.join(random.choice(string.ascii_letters) for i in range(5))) for i in range(10)),
             columns=['국어', '영어', '수학', '사회']
            )

       국어  영어  수학  사회
piljH  83  64   4  47
NUQcx  83  85  32   0
Vwvva  41  64  46  43
SlqxP   9  32  63  29
OiMIa  67  53  60  70
CcUfT  14  66  36  96
iAcSM  56  70  55  94
VzglP  16   1  49  61
ApNlw  21  38  61  14
Jkdjf  30  25  88  21

In [60]:
df = pd.DataFrame({"국어":score(), "영어":score(), "수학":score(), "사회":score()}, index=[id()])
for i in range(1,10):
    df.loc[id()] = {"국어":score(), "영어":score(), "수학":score(), "사회":score()}
df

       국어  영어  수학  사회
XYnjv  28  33  25  74
MIVAu  25  32  15  22
NdBsc  51  43  43  41
uSnBE  57  71   3  15
JUFTL  86  64  19   4
JEgfi  61   5   7  18
NaabL  42  84  72  34
xaOGi  95   6  37  50
msjxS  59  16   5  19
MTQzX  51  26  89  48